---
kind: enumMember
id: F:Autodesk.Revit.DB.PathType.Content
enum: Autodesk.Revit.DB.PathType
source: html/dab91714-40d3-bc4a-6c5e-1b5eb504e341.htm
---
# Autodesk.Revit.DB.PathType.Content

The path is relative to a location in the Revit content libraries.
 This value is only valid for ExternalFileReferenceType.KeynoteTable,
 ExternalFileReferenceType.AssemblyCodeTable or ExternalFileReferenceType.Decal.